PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/nnkernel_v1/COMPONENT_PSE84_A0/include/cy_nn_kernel.h
/***************************************************************************//**
* \file cy_nn_kernel.h
* \version 1.0
*
* \brief
* Provides NNLite accelerator driver API declarations.
*
********************************************************************************
* \copyright
* Copyright 2016-2022 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
*
* \section group_nn_kernel_changelog Changelog
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>2.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
*******************************************************************************/


/*****************************************************************************/
/* Include files                                                             */
/*****************************************************************************/
#ifndef CY_NN_KERNEL_H
#define CY_NN_KERNEL_H

#if defined(__cplusplus)
extern "C" {
#endif
#include "cy_device.h"
#include "cy_pdl.h"

#define OUT_SCALING_FACTOR_EXP_MIN 96
#define OUT_SCALING_FACTOR_EXP_MAX 135

#if CY_IP_MXNNLITE_VERSION !=1
#include "cy_nn_types.h"
#endif

/**
* \defgroup group_nn_kernel NNLITE HW Accelerator KERNEL LIB
* \{
* This driver provides NN Kernel level defines and API function definitions for NNLITE Lite HW  accelerator.
* \defgroup group_nn_kernel_macros  Macros
* \defgroup group_nn_kernel_enums Enums
* \defgroup group_nn_kernel_data_structures  Structures
* \defgroup group_nn_kernel_functions functions
* \} */

/** \addtogroup group_nn_kernel_macros
* \{
*/
/*****************************************************************************/
/* Global pre-processor symbols/macros ('#define')                           */
/*****************************************************************************/
#ifndef NNLITE_DEFAULT_ISR_PRIORITY
#define NNLITE_DEFAULT_ISR_PRIORITY (2U) /**< Default Interrupt Priority for NNLite */
#endif
#if CY_NNLITE_ACTIVATION_8BIT != CY_NNLITE_OUTPUT_8BIT || CY_NNLITE_ACTIVATION_16BIT != CY_NNLITE_OUTPUT_16BIT
#error Reinterpretation of activation bitwidth to output bitwidth not possible
#else
#define CY_NNLITE_ACT_AS_OUT_BW(act_bw) ((cy_en_nnlite_output_size_t)(act_bw)) /**< size control helper macro for output size */
#define CY_NNLITE_OUT_AS_ACT_BW(act_bw) ((cy_en_nnlite_activation_size_t)(act_bw)) /**< size control helper macro for input size */
#endif

/** \} group_nn_kernel_macros */

/** \addtogroup group_nn_kernel_enums
* \{
*/
#if CY_IP_MXNNLITE_VERSION==1
/** NNLite DMA descriptor types */
typedef enum
{
    CY_NNLITE_DMA_DESC_MEMIO = 0,/**< Descriptor is for MEMIO transfer */
    CY_NNLITE_DMA_DESC_TRANSPOSE,/**< Descriptor is for Transpose operation */
} cy_nnlite_current_dma_desc_type_t;

/** NNLite DMA queue states */
typedef enum
{
    CY_NNLITE_DMA_QUEUE_EMPTY = 0, /**< nnlite dma queue is empty */
    CY_NNLITE_DMA_OPERATION_QUEUED,/**< nnlite dma operation queued */
    CY_NNLITE_DMA_QUEUE_TRIGGERED, /**< nnlite dma is triggered */
    CY_NNLITE_DMA_QUEUE_DONE, /**< nnlite dma is executed */
} cy_nnlite_dma_queue_state_t;

/** NNLite Kernel API's intermediate Profile points types */
typedef enum
{
    CY_NNLITE_PP_ACCELERATOR_START = 0,/**< Profile point for NNLite IP start */
    CY_NNLITE_PP_TRANSPOSE_START,/**< Profile point for TRANSPOSE Operation*/
    CY_NNLITE_PP_TRANSPOSE_DMA_TRIGGER,/**< Profile point for TRANSPOSE DMA Trigger */
    CY_NNLITE_PP_TRANSPOSE_DONE,/**< Profile point for TRANSPOSE DMA Completion */
    CY_NNLITE_PP_DMA_MODE_TRIGGER,/**< Profile point for DMA Mode API DMA Trigger */
    CY_NNLITE_PP_DMA_MODE_END,/**< Profile point for DMA Mode Completion */
    CY_NNLITE_PP_ACCELERATOR_DONE,/**< Profile point for NNLite Completion */
    CY_NNLITE_PP_COUNT,/**< Profile point Count */
} cy_nnlite_profile_points_type_t;
#else

/** NNLite DMA queue states */
typedef enum
{
    CY_NNLITE_DMA_QUEUE_EMPTY = 0, /**< nnlite dma queue is empty */
    CY_NNLITE_DMA_OPERATION_QUEUED,/**< nnlite dma operation queued */
    CY_NNLITE_DMA_QUEUE_TRIGGERED, /**< nnlite dma is triggered */
    CY_NNLITE_DMA_QUEUE_DONE, /**< nnlite dma is executed */
} cy_nnlite_dma_queue_state_t;

/** NNLite DMA descriptor types */
typedef enum
{
    CY_NNLITE_DMA_DESC_MEMIO = 0,/**< Descriptor is for MEMIO transfer */
} cy_nnlite_current_dma_desc_type_t;

/** NNLite Kernel API's intermediate Profile points types */
typedef enum
{
    CY_NNLITE_PP_ACCELERATOR_START = 0,/**< Profile point for NNLite IP start */
    CY_NNLITE_PP_DMA_MODE_TRIGGER,/**< Profile point for DMA Mode API DMA Trigger */
    CY_NNLITE_PP_DMA_MODE_END,/**< Profile point for DMA Mode Completion */
    CY_NNLITE_PP_ACCELERATOR_DONE,/**< Profile point for NNLite Completion */
} cy_nnlite_profile_points_type_t;
#endif

/** \} group_nn_kernel_enums */

/**
* \addtogroup group_nn_kernel_data_structures
* \{
*/

/**
 *****************************************************************************
 ** \brief Convolution parameter structure
 *****************************************************************************/
typedef struct cy_nn_conv_params_s
{
#if CY_IP_MXNNLITE_VERSION==1
    int32_t startCol; /**< Activation start column */
    int32_t startRow; /**< Activation start Row */
#endif
    int16_t padValue; /**< padding value for activation */
    uint8_t padWidth; /**< padding width - padded columns before data start*/
    uint8_t padHeight; /**< padding height - padded rows before data start*/
    uint8_t strideCol; /**< stride column */
    uint8_t strideRow; /**< stride Row  */
    int32_t inputOffset; /**< activation value offset */
    int32_t outputOffset; /**< output offset value */
    int32_t filterOffset; /**< filter offset value */
#if CY_IP_MXNNLITE_VERSION==1
    int32_t outClippingMask; /**< output value saturated to max/min based on\
                            clippingMask value*/
    float *outScalingFactor; /**< per axis output scaling factor */
#else
    const float *outScalingFactor; /**< per axis output scaling factor */
    cy_nnlite_clipping_t outClipping; /**< output value clipping */
    cy_en_nnlite_activation_size_t  act_size; /**< Selection activation data-path width */
    bool sparseWeights;                         /**< Packed Sparse weights */
#endif
    int8_t *scratchBuf; /**< scratch buffer for convolution layer, will be used\
                       DMA descriptors in DMA mode */
} cy_nn_conv_params_t;

/**
 *****************************************************************************
 ** \brief FC parameter structure
 *****************************************************************************/
typedef struct cy_nn_fc_params_s
{
    int32_t inputOffset; /**< activation value offset */
    int32_t outputOffset; /**< output offset vaLUE */
    int32_t filterOffset; /**< Filter offset value */
    float outScalingFactor; /**< output scaling factor */
#if CY_IP_MXNNLITE_VERSION==1
    int32_t outClippingMask; /**< output value saturated to max/min based on\
                            clippingMask value*/
#else
    cy_nnlite_clipping_t outClipping; /**< output value clipping */
    cy_en_nnlite_activation_size_t inputSize;   /**< Input data precision */
    cy_en_nnlite_output_size_t     outputSize;  /**<  Output precision  */
    bool sparseWeights;                         /**< Packed Sparse weights */
#endif
    int8_t *scratchBuf; /**< scratch buffer for fc layer, will be used for for\
                       DMA descriptors and MEMIO configuration in DMA mode */
} cy_nn_fc_params_t;

