PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/nnkernel_v1/COMPONENT_PSE84_A0/include/cy_nn_kernel.h
#if CY_IP_MXNNLITE_VERSION==1
/**
 *****************************************************************************
 ** \brief Average pool parameter structure
 *****************************************************************************/
typedef struct
{
    uint8_t padWidth; /**< padding width */
    uint8_t padHeight; /**< padding height */
    uint8_t strideCol; /**< stride column */
    uint8_t strideRow; /**< stride row */
    int32_t outClippingMask; /**< output value saturated to max/min based on\
                           clippingMask value*/
    int8_t *scratchBuf;   /**< used for transpose operations,
                           DMA descriptors and MEMIO configuration in DMA mode */
} cy_nn_avgpool_params_t;
#else
/**
 *****************************************************************************
 ** \brief Average pool parameter structure
 *****************************************************************************/
typedef struct cy_nn_pool_params_s
{
    uint8_t strideCol; /**< stride column */
    uint8_t strideRow; /**< stride row */
    cy_nnlite_clipping_t outClipping; /**< output value clipping */
    cy_en_nnlite_activation_size_t  act_size; /**< Selection activation data-path width */
    int8_t *scratchBuf;   /**< DMA descriptors and MEMIO configuration in DMA mode */
} cy_nn_pool_params_t;
#endif

#if CY_IP_MXNNLITE_VERSION !=1
/**
 *****************************************************************************
 ** \brief Pointwise operation parameter structure
 *****************************************************************************/
typedef struct cy_nn_scaling_s
{
    /**  Scale factor to apply to (one) MAC input */
    float pre_mac_scale;
    /** Scale factor to apply prior to activation function (if any) */
    float pre_act_scale;
    /** Mode for MAC input scaling (off, weights, activations)*/
    cy_en_nnlite_input_rescaling_t  pre_mac_scaling_mode;
    /** Mode for pre-activation scaling (off, per-tensor, per-channels) */
    cy_en_nnlite_output_rescaling_t pre_act_scaling_mode;
    /** Scaling to apply to activation output ("output rescaling factor")*/
    float post_act_scale;
    int8_t *scratchBuf;   /**< DMA descriptors and MEMIO configuration in DMA mode */
} cy_nn_scaling_t;

/**
 *****************************************************************************
 ** \brief Pointwise binary operation parameter structure
 *****************************************************************************/
typedef struct cy_nn_pwise_binary_params_s
{
    int32_t   lhsOffset;  /**<  Zero-point for lhs values */
    int32_t   rhsOffset;  /**<  Zero-point for rhs values */
    int32_t   outputOffset;  /**<  Zero-point to use for output */
    cy_nnlite_clipping_t outClipping; /**< output value clipping */
    cy_en_nnlite_activation_size_t inputSize;   /**< Input data precision */
    cy_en_nnlite_output_size_t     outputSize;  /**<  Output precision  */
    cy_nn_scaling_t scaling; /**< Pointwise operation parameter */
    int8_t *scratchBuf;   /**< DMA descriptors and MEMIO configuration in DMA mode */
} cy_nn_pwise_binary_params_t;

/**
 *****************************************************************************
 ** \brief Pointwise unary operation parameter structure
 **
 *****************************************************************************/
typedef struct cy_nn_pwise_unary_params_s
{
    float     inScale;   /**< Pre-scaling to apply to lhs before op (must be 1.0 if rhsScale != 1.0)*/
    int32_t   inOffset;  /**<  Zero-point for lhs values */
    float     outScale;   /**<  Scale factor to apply to results of op values () */
    int32_t   outOffset;  /**<  Zero-point to use for output */
    cy_nnlite_clipping_t outClipping; /**< output value clipping */
    cy_en_nnlite_activation_size_t inputSize;   /**< Input data precision */
    cy_en_nnlite_output_size_t     outputSize;  /**<  Output precision  */
    int8_t *scratchBuf;   /**< DMA descriptors and MEMIO configuration in DMA mode */
} cy_nn_pwise_unary_params_t;

/**
 *****************************************************************************
 ** \brief Layer Normmalization operation parameter structure
 **
 *****************************************************************************/
typedef struct cy_nn_layernorm_params_s
{
    float     inScale;   /**< Pre-scaling to apply to input before op */
    int32_t   inOffset;  /**<  Zero-point for input values */
    float     outScale;   /**<  Scale factor to apply to results of op values */
    int32_t   outOffset;  /**<  Zero-point to use for output */
    float     epsilon;        /**<  Constant value, used for numeric stability */
    cy_nnlite_clipping_t outClipping; /**< output value clipping */
    cy_en_nnlite_activation_size_t inputSize;   /**< Input data precision */
    cy_en_nnlite_output_size_t     outputSize;  /**<  Output precision  */
    int8_t *scratchBuf;  /**<  Scratch buffer for intermediate tensors  */
} cy_nn_layernorm_params_t;

#endif

/**
 *****************************************************************************
 ** \brief dimension structure for input, output & filter
 ** dimension array of tensor, ordering of dimension should be same as
 ** TF model file, e.g. for convolution layer input height and width order
 ** should be input height = inputDims->dims[1],
 ** input width = inputDims->dims[2],
 ** filter dimension order should be filter_height = filterDims->dims[1],
 ** filter_width = filterDims->dims[2],filter_depth = filterDims->dims[3],
 ** output dimension order should be output_height = outputDims->dims[1],
 ** output_width = outputDims->dims[2]
 **
 *****************************************************************************/
typedef struct cy_nn_dims_s
{
    uint32_t dims[4];  /**<  dimension array of tensor */
} cy_nn_dims_t;

#if CY_IP_MXNNLITE_VERSION ==1
/**
 *****************************************************************************
 ** \brief activation parameter structure
 *****************************************************************************/
typedef struct
{
    uint16_t intercept0; /**< intercept value for interpolation,
                           x<0, LUTAddr = 0 */
    uint16_t intercept1; /**< intercept value for interpolation,
                           x>=0, LUTAddr = 1 */
    uint16_t slope0; /**< slope value for interpolation, x<0, LUTAddr = 0 */
    uint16_t slope1; /**< slope value for interpolation, x>=0, LUTAddr = 1 */
} cy_nn_act_intrpl_param_t;
#else
/**
 *****************************************************************************
 ** \brief activation parameter structure
 *****************************************************************************/
typedef struct
{
    float segment[2]; /**< Interpolation values index 0: x >= 0, index 0 1: x < 0 */
} cy_nn_act_intrpl_param_t;

#endif

/**
 *****************************************************************************
 ** \brief nnlite dma descriptor queue structure, use to maintain DMA
 ** channel info and DMA Queue Descriptor pointers
 *****************************************************************************/
typedef struct cy_nnlite_dma_queue_config
{
    cy_stc_dma_channel_config_t channelConfig; /**< DMA channel config */
    cy_stc_dma_descriptor_config_t *currCfgDesc; /**< DMA Queue config descriptor
                                                current pointer */
    cy_stc_dma_descriptor_t *currDesc; /**< DMA Queue descriptor
                                                current pointer */
    cy_nnlite_current_dma_desc_type_t currDescType;/**< DMA descriptor
                                                 MEMIO or Transpose type */
    cy_stc_dma_descriptor_t *headDesc; /**< DMA Queue descriptor
                                                head pointer */
    uint32_t dmaQDepth; /**< DMA Queue depth */
    cy_nnlite_dma_queue_state_t dmaQState; /**< DMA Q state */
} cy_nnlite_dma_queue_config_t;
/**
 *****************************************************************************
 ** \brief typedef for callback function, called from interrupt handler,
 ** to signal completion of layer, as called from  interrupt handler callback
 ** function should not call any blocking function and should have
 ** minimum code required for completion signal
 ** \param [in]  cbArg    argument with which callback function will be called
 **
 ** \param [in]  status   status of operation
 *****************************************************************************/
typedef void (*Cy_NNLite_CompletionCallback)(void *cbArg,
        cy_en_nnlite_status_t status);

/**
 *****************************************************************************
 ** \brief typedef for Mutex create function
 *****************************************************************************/
typedef uint32_t (*Cy_NNLite_MutexCreate)(void *ptr);

/**
 *****************************************************************************
 ** \brief typedef for Mutex delete function
 *****************************************************************************/
typedef uint32_t (*Cy_NNLite_MutexDelete)(void *ptr);

/**
 *****************************************************************************
 ** \brief typedef for mutex lock function
 *****************************************************************************/
typedef uint32_t (*Cy_NNLite_MutexLock)(void *ptr);

/**
 *****************************************************************************
 ** \brief typedef for mutex unlock function
 *****************************************************************************/
typedef uint32_t (*Cy_NNLite_MutexUnlock)(void *ptr);

/**
 *****************************************************************************
 ** \brief typedef for sem create function
 *****************************************************************************/
typedef uint32_t (*Cy_NNLite_SemCreate)(void *ptr);
/**
 *****************************************************************************
 ** \brief typedef for sem delete function
 *****************************************************************************/
typedef uint32_t (*Cy_NNLite_SemDelete)(void *ptr);
/**
 *****************************************************************************
 ** \brief typedef for sem wait function
 *****************************************************************************/
typedef uint32_t (*Cy_NNLite_SemWait)(void *ptr);

/**
 *****************************************************************************
 ** \brief typedef for sem give function
 *****************************************************************************/
typedef uint32_t (*Cy_NNLite_SemGive)(void *ptr);

/**
 *****************************************************************************
 ** \brief typedef for LPM lock function
 *****************************************************************************/
typedef void (*Cy_NNLite_LpmLock)(void);

/**
 *****************************************************************************
 ** \brief typedef for LPM unlock function
 *****************************************************************************/
typedef void (*Cy_NNLite_LpmUnlock)(void);

/**
 *****************************************************************************
 ** \brief typedef for profile start function, called at start of API
 *****************************************************************************/
typedef void (*Cy_NNLite_ProfileStart)(void *ptr);

/**
 *****************************************************************************
 ** \brief typedef for profile get count at intermediate profile point
 *****************************************************************************/
typedef void (*Cy_NNLite_ProfileGetCount)(void *ptr, uint32_t profilePoint);

/**
 *****************************************************************************
 ** \brief typedef for profile end function called at end of API
 *****************************************************************************/
typedef void (*Cy_NNLite_ProfileStop)(void *ptr);



/**
 *****************************************************************************
 ** \brief nnlite kernel config structure, to be filled passed in kernel Init
 ** function to setup function pointers
 *****************************************************************************/
typedef struct cy_kernel_config
{
    Cy_NNLite_CompletionCallback completionCbFunc; /**< Kernel completion called back
                        function, to filled by upper layer, should not
                        have/call blocking implementation*/
    void *cbArg; /**< argument with which callback function will be called */

    void *nnliteMutex; /**< Mutex to be allocated in RTOS environment */
    void *nnliteSem; /**< Semaphore to be allocated in RTOS environment */
    Cy_NNLite_MutexCreate mutexCreateFunc; /**< Mutex Create function pointer */
    Cy_NNLite_MutexDelete mutexDeleteFunc; /**< Mutex Delete function pointer */
    Cy_NNLite_MutexLock mutexLockFunc; /**< Mutex Lock function pointer */
    Cy_NNLite_MutexUnlock mutexUnlockFunc; /**< Mutex Unlock function pointer */
    Cy_NNLite_SemCreate SemCreateFunc; /**< Sem Create function pointer */
    Cy_NNLite_SemDelete SemDeleteFunc; /**< Sem Delete function pointer */
    Cy_NNLite_SemWait SemWaitFunc; /**< Sem wait function pointer */
    Cy_NNLite_SemGive SemGiveFunc; /**< Sem give function pointer */
    Cy_NNLite_LpmLock LpmLockFunc; /**< LPM lock function pointer */
    Cy_NNLite_LpmUnlock LpmUnlockFunc; /**< LPM unlock function pointer */
    Cy_NNLite_ProfileStart profStart; /**< profiler start */
    Cy_NNLite_ProfileGetCount profGetCount; /**< get count intermediate profile points */
    Cy_NNLite_ProfileStop profStop; /**< profiler end */
    void *profArg; /**< argument with which profiler callback functions will be called */
    uint32_t intrPriority; /**< NNLite and DMA Channel interrupt Priority */
} cy_kernel_config_t;


