PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/nnkernel_v1/COMPONENT_PSE84_A0/include/cy_nn_kernel.h
/** \} group_nn_kernel_data_structures */

/*******************************************************************************
*                           Function Prototypes
*******************************************************************************/

/**
* \addtogroup group_nn_kernel_functions
* \{
*/

/*****************************************************************************/
/* Global function prototypes ('extern', definition in C source)             */
/*****************************************************************************/
#if CY_IP_MXNNLITE_VERSION ==1
/**
 *****************************************************************************
 ** \brief  A function which returns a "virtual-weights" array's size for
 ** average pooling cases
 ** \retval size of  AvgPool Kernel weights
 *****************************************************************************/
uint32_t Cy_NNLite_GetAvgPoolKernelWeightSize(void);
/**
*****************************************************************************
** \brief  return AvgPool Kernel weight pointer
** All-ones const weights array used by AvgPool
** Size is returned by Cy_NNLite_GetAvgPoolKernelWeightSize.
** These are best held in non-volatile "code" memory as the
** NNLite's bus connectivity is optimized for this.
** Held in SRAM banks will result in heavy contention
** between the weight and activation streaming engines.
**
** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
int8_t *Cy_NNLite_GetAvgPoolKernelWeightPtr(void);

/**
 *****************************************************************************
 ** \brief  A function set "virtual-weights" array's pointer and size for
 ** average pooling cases when valid pointer and size is passed, in case of
 ** NULL pointer or 0 size array's pointer will be reset to default value
 ** pointer should not be freed until AvgPool weight pointer is reset to
 ** default by calling same API with NULL pointer value or 0 size in argument
 **
 ** \param [in]  weightsArrayPtr   AvgPool Kernel weight array pointer
 **
 ** \param [in]  weightsArraySize  AvgPool Kernel weight array size

 *****************************************************************************/
cy_en_nnlite_status_t  Cy_NNLite_SetAvgPoolKernelWeightArrayPtr(
    int8_t *weightsArrayPtr, uint32_t weightsArraySize);

/**
 *****************************************************************************
 ** \brief 2D Convolution CPU mode kernel API, API will configure nnlite and
 ** then start nnlite operation. API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 ** intrplParam can be passed as NULL for default behavior of activation,
 ** to parametrize activation pass valid  intrplParam.
 ** filterData points to weights if sparsityBaseAddr is NULL otherwise weights
 ** pointer will be derived from sparsityBaseAddr and filterData will
 ** not be used.
 ** Valid scratch buffer should be passed in convParam, scratch buffer will be
 ** used for transpose operation (transpose scratch buffer and transpose DMA
 ** descriptors)for per axis convolution implementation, size of scratch buffer
 ** should be derived by calling function Cy_NNLite_ConvolutionScratchBufSize.
 ** Scratch buffer should be 4 byte aligned, and can be freed after receiving
 ** completion callback of API in case non blocking mode.
 ** For Multiscaling outData pointer should be 4 byte aligned for DMA transpose
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims       output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter pointer
 **
 ** \param [in]  biasData         bias pointer
 **
 ** \param [in]  sparsityBaseAddr sparsity map base pointer
 **
 ** \param [in]  convParam        convolution parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for output activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Convolution(const int8_t* inputData, int8_t* outData,
                      const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                      const cy_nn_dims_t *filterDims, const int8_t *filterData,
                      const int32_t *biasData, const void *sparsityBaseAddr,
                      cy_nn_conv_params_t *convParam,
                      cy_en_nnlite_fused_activation_t actType,
                      cy_nn_act_intrpl_param_t *intrplParam);

/**
 *****************************************************************************
 ** \brief Fully connected CPU mode kernel API, API will configure nnlite and
 ** then start nnlite operation. API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 ** intrplParam can be passed as NULL for default behavior
 ** of activation, to parametrize activation pass valid  intrplParam.
 ** filterData points to weights If sparsityBaseAddr is NULL, otherwise
 ** weights pointer will be derived from sparsityBaseAddr and filterData
 ** will not be used.
 ** No scratch buffer is required in CPU mode fully connected
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims       output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter pointer
 **
 ** \param [in]  biasData         bias pointer
 **
 ** \param [in]  sparsityBaseAddr sparsity map base pointer
 **
 ** \param [in]  fcParam          fully Connected parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for output activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_FullyConnected(const int8_t* inputData, int8_t* outData,
                         const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                         const cy_nn_dims_t *filterDims, const int8_t *filterData,
                         const int32_t *biasData, const void *sparsityBaseAddr,
                         cy_nn_fc_params_t *fcParam,
                         cy_en_nnlite_fused_activation_t actType,
                         cy_nn_act_intrpl_param_t *intrplParam);
/**
 *****************************************************************************
 ** \brief Average pool CPU mode kernel API, API will configure nnlite.
 ** and then start nnlite operation. API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 ** Valid scratch buffer should be allocated and passed in avgpoolParam and
 ** scratch buffer should be 4 byte aligned. Size of scratch buffer should be
 ** calculated using API Cy_NNLite_AvgpoolDMAScratchBufSize
 ** Scratch buffer can be freed after receiving completion callback of API.
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims       output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  avgpoolParam     average pool parameter structure pointer
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Avgpool(const int8_t* inputData, int8_t* outData,
                  const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                  const cy_nn_dims_t *filterDims,
                  cy_nn_avgpool_params_t *avgpoolParam);

/**
 *****************************************************************************
 ** \brief 2D Convolution kernel DMA API, API will fill DMA descriptor
 ** pointing nnlite MEMIO configuration structure.
 ** intrplParam can be passed as NULL for default behavior of activation, to
 ** parametrize activation pass valid  intrplParam.
 ** filterData points to weights If sparsityBaseAddr is NULL otherwise weights
 ** pointer will be derived from sparsityBaseAddr and filterData will
 ** not be used.
 ** Valid scratch buffer should be passed in convParam, scratch buffer will be
 ** used for nnlite MEMIO configuration structure (per axis 1), and for
 ** transpose operation for per axis (transpose scratch buffer and transpose
 ** DMA descriptors) convolution implementation, size of scratch buffer should
 ** be derived by calling function Cy_NNLite_ConvolutionScratchBufSize.
 ** Scratch buffer should be 4 byte aligned and can be freed after receiving completion
 ** callback in case of Non blocking mode.
 ** N convolutions Descriptors and Transpose Descriptors will be Queue in DMA
 ** together. CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue.Callback function from kernel config
 ** structure will be called after completion of all queued layers
 ** kernel config structure should point to valid callback function.
 ** For Multiscaling outData pointer should be 4 byte aligned for DMA transpose
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims       output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter pointer
 **
 ** \param [in]  biasData         bias pointer
 **
 ** \param [in]  sparsityBaseAddr sparsity map base pointer
 **
 ** \param [in]  convParam        convolution parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for output activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_ConvolutionDMA(const int8_t* inputData, int8_t* outData,
                         const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                         const cy_nn_dims_t *filterDims, const int8_t *filterData,
                         const int32_t *biasData, const void *sparsityBaseAddr,
                         cy_nn_conv_params_t *convParam,
                         cy_en_nnlite_fused_activation_t actType,
                         cy_nn_act_intrpl_param_t *intrplParam);

/**
 *****************************************************************************
 ** \brief DMA based fully connected(Dense) kernel API, API will fill DMA
 ** descriptor pointing NNLite MEMIO configuration structure.
 ** intrplParam can be passed as NULL for default behavior of activation,
 ** to parametrize activation pass valid  intrplParam.
 ** filterData points to weights if sparsityBaseAddr is NULL otherwise weights
 ** pointer will be derived from sparsityBaseAddr and filterData will not be
 ** used.
 ** Valid scratch buffer should be passed in fcParam, scratch buffer will be
 ** used for DMA descriptors and for nnlite MEMIO configuration structure for
 ** DMA. Size of scratch buffer should be calculated using API
 ** Cy_NNLite_FullyConnectedDMAScratchBufSize
 ** API will setup DMA descriptor and will Queue DMA operation.
 ** CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue. Callback function from kernel config will
 ** be called after completion of all queued layers, kernel config
 ** structure should point to valid callback function.Scratch buffer can be
 ** freed after receiving completion callback.
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims       output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter pointer
 **
 ** \param [in]  biasData         bias pointer
 **
 ** \param [in]  sparsityBaseAddr sparsity map base pointer
 **
 ** \param [in]  fcParam          fully Connected parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for output activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_FullyConnectedDMA(const int8_t* inputData, int8_t* outData,
                            const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                            const cy_nn_dims_t *filterDims, const int8_t *filterData,
                            const int32_t *biasData, const void *sparsityBaseAddr,
                            cy_nn_fc_params_t *fcParam,
                            cy_en_nnlite_fused_activation_t actType,
                            cy_nn_act_intrpl_param_t *intrplParam);

/**
 *****************************************************************************
 ** \brief Average pool kernel API DMA mode, API will fill DMA descriptor
 ** pointing NNLite MEMIO configuration structure.Implemented in nnlite using
 ** convolution.
 ** Valid scratch buffer should be allocated and passed in
 ** avgpoolParam. Scratch buffer should be 4 byte aligned and size of scratch buffer
 ** should be calculated using API
 ** Cy_NNLite_AvgPoolDMAScratchBufSize. Scratch buffer will be used for DMA
 ** descriptors and for MEMIO configuration structure and for creating
 ** weights for weights streamer for convolution operation.
 ** API will setup DMA descriptor and will Queue DMA operation.
 ** CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue.
 ** Callback function from kernel config will be called after completion of
 ** all queued layers,kernel config structure should point to valid
 ** callback function. Scratch buffer can be freed after receiving completion
 ** callback.
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims       output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  avgpoolParam     average pool parameter structure pointer
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_AvgpoolDMA(const int8_t* inputData, int8_t* outData,
                     const cy_nn_dims_t *inputDims,
                     const cy_nn_dims_t *outputDims,
                     const cy_nn_dims_t *filterDims,
                     cy_nn_avgpool_params_t *avgpoolParam);

/**
 *****************************************************************************
 ** \brief Cy_NNLite_TriggerDMAQueue will trigger DMA transfer of Queued layer
 ** starting from first queued layer, callback function will be called after
 ** completion of all the Queued layer if valid callback function is passed
 ** in kernel context, API will work in blocking mode if callback function is
 ** NULL
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_TriggerDMAQueue(void);

/**
 *****************************************************************************
 ** \brief Cy_NNLite_GetQueuedLayerCount will return count of queued layer
 ** for DMA
 **
 ** \retval dmaQDepth number of layers in DMA Queue
 *****************************************************************************/
uint32_t Cy_NNLite_GetQueuedLayerCount(void);

/**
 *****************************************************************************
 ** \brief API will return return size of scratch buffer in bytes for Average
 ** pool kernel in CPU mode, buffer size will be equal to filter
 ** dimensions
 **
 ** \param [in]  filterDims  filter dimension
 ** \param [in]  inDims      input dimension
 ** \param [in]  outDims     output dimension
 ** \retval buffer size
 *****************************************************************************/
uint32_t Cy_NNLite_AvgpoolScratchBufSize(const cy_nn_dims_t *filterDims,
        const cy_nn_dims_t *inDims, const cy_nn_dims_t *outDims);


/**
 *****************************************************************************
 ** \brief API will return return size of scratch buffer in bytes for Average
 ** pool kernel in DMA mode, buffer size will be equal to filter dimensions
 ** plus cy_nnlite_memio_dma_t and dma descriptors, cy_nnlite_memio_dma_t will
 ** be used as source pointer having nnlite MEMIO configuration
 **
 ** \param [in]  filterDims  filter dimension
 ** \param [in]  inDims  input dimension
 ** \param [in]  outDims  output dimension
 **
 ** \retval buffer size
 *****************************************************************************/
uint32_t Cy_NNLite_AvgpoolDMAScratchBufSize(const cy_nn_dims_t *filterDims,
        const cy_nn_dims_t *inDims, const cy_nn_dims_t *outDims);

/**
 *****************************************************************************
 ** \brief ConvolutionScratchBufSize API will return scratch buffer size for
 ** convolution kernel CPU mode, buffer will be used for transpose function
 ** which will required scratch buffer equal to out buffer plus DMA
 ** descriptor, count of descriptors depends on size of output buffer
 ** if all scaling factor pointed by outScalingFactor are equal, transpose
 ** functionality will not be required and size return will be 0 bytes
 **
 ** \param [in]  filterDims  filter dimension
 ** \param [in]  outputDims  output dimension
 ** \param [in]  outScalingFactor scaling factor array pointer
 **
 ** \retval buffer size
 *****************************************************************************/
uint32_t Cy_NNLite_ConvolutionScratchBufSize(const cy_nn_dims_t *filterDims,
        const cy_nn_dims_t *outputDims,
        float *outScalingFactor);

/**
 *****************************************************************************
 ** \brief Cy_NNLite_ConvolutionDMAScratchBufSize API will return scratch
 ** buffer size for convolution kernel DMA mode, buffer will be used for
 ** cy_nnlite_memio_dma_t * number of filters plus transpose function which
 ** will required scratch buffer equal to out buffer plus DMA descriptors,
 ** count of descriptors depends on size of output buffer
 ** if all scaling factor pointed by outScalingFactor are equal, transpose
 ** functionality will not be required, buffer size will be for only for DMA
 ** operation
 **
 ** \param [in]  filterDims  filter dimension
 ** \param [in]  outputDims  output dimension
 ** \param [in]  outScalingFactor scaling factor array pointer
 **
 ** \retval buffer size
 *****************************************************************************/
uint32_t
Cy_NNLite_ConvolutionDMAScratchBufSize(const cy_nn_dims_t *filterDims,
                                       const cy_nn_dims_t *outputDims,
                                       float *outScalingFactor);

/**
 *****************************************************************************
 ** \brief API will return scratch buffer size for fully connected DMA mode
 ** kernel, buffer will be used for DMA descriptors and for MEMIO
 ** configuration structure of type cy_nnlite_memio_dma_t for DMA
 **
 ** \retval buffer size
 *****************************************************************************/
uint32_t Cy_NNLite_FullyConnectedDMAScratchBufSize(void);

/**
 *****************************************************************************
 ** \brief Cy_NNLite_GetCurrDMAQueue API will copy current dma queue in to
 ** dmaQueue pointer, valid dmaQueue pointer should be passed.
 ** To get the runnable queue Cy_NNLite_GetCurrDMAQueue should be
 ** called after the created in Kernel DMA API such as Cy_NNLite_AvgpoolDMA
 ** and get executed by calling Cy_NNLite_TriggerDMAQueue
 **
 ** \param [in] dmaQueue dma queue pointer in which dma queue will be copied
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_GetCurrDMAQueue(cy_nnlite_dma_queue_config_t *dmaQueue);

/**
 *****************************************************************************
 ** \brief Cy_NNLite_RunDMAQueue API will Trigger DMA dmaQueue queue
 ** valid dmaQueue pointer should be passed, DMA queue should return
 ** from Cy_NNLite_GetCurrDMAQueue
 ** queue will be in  runnable state if Cy_NNLite_GetCurrDMAQueue
 ** called after queue created in Kernel DMA API such as Cy_NNLite_AvgpoolDMA
 ** and get executed by calling Cy_NNLite_TriggerDMAQueue.
 ** API will work in blocking mode if callback function is passed as NULL
 ** in kernel context
 **
 ** \param [in] dmaQueue dma queue pointer in which dma queue will be copied
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_RunDMAQueue(cy_nnlite_dma_queue_config_t *dmaQueue);

/**
 *****************************************************************************
 ** \brief  Kernel Init API, initializes PDL driver and setup IRQ handler and
 ** setup function pointers from kernelConfig argument. KernelConfig should
 ** have valid pointer for Mutex variable and function pointers for
 ** mutexCreate, mutexDelete, mutexLock, mutexUnlock and and should have valid
 ** pointers for Semaphore variable and function pointers for SemCreate,
 ** SemDelete, SemWait and SemGive for synchronization primitives. This API will
 ** allocate mutex and semaphore by calling mutexCreate and SemCreate, and will
 ** use them in successive call to other kernel public API's. API needs to be
 ** called before calling any other kernel API, If any of the pointers in
 ** KernelConfig is not valid API will return error code ,return value of API
 ** should be check to confirm successful initialization.
 **
 ** \param [in]  kernelConfig  kernel configuration structure
 **
 ** \retval cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_KernelInit(cy_kernel_config_t *kernelConfig);

