PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/nnkernel_v1/COMPONENT_PSE84_A0/include/cy_nn_kernel.h
/**
*****************************************************************************
** \brief  Kernel Deinit API, de-initialize PDL driver and synchronization
** primitives. needs re initialization after this API is called. Should be
** called only at end of program
**
** \retval cy_en_nnlite_status_t
*****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_KernelDeInit(void);
#else
/**
 *****************************************************************************
 ** \brief Set PWL interpolation parameters for LeakyRElU activation
 **
 ** [in]  alpha_scale    LeakyRelU  scale for alpha parameter (may fold in a rescaling factor)
 ** [in]  unit_scale    LeakyRelU  scale for unit gradient (may fold in a rescaling factor)
 ** [in]  inParam  Pointer to PWL activation struct to set for specified @c alpha
 *****************************************************************************/

void Cy_NNLite_LeakyRelUPWLActivation(float alpha_scale, float unit_scale,
                                      cy_nn_act_intrpl_param_t *leakyRelU);

/**
 *****************************************************************************
 ** \brief 2D Convolution CPU mode kernel API, API will configure nnlite and
 ** then start nnlite operation.API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 **
 ** filterData points to weights if sparse weight or non sparse based base on
 ** type of packing is used
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter pointer
 **
 ** \param [in]  biasData         bias pointer
 **
 ** \param [in]  convParam        convolution parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for PWL @c actType output activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Convolution(const int8_t* inputData, int8_t* outData,
                      const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                      const cy_nn_dims_t *filterDims, const int8_t *filterData,
                      const int32_t *biasData,
                      cy_nn_conv_params_t *convParam,
                      cy_en_nnlite_fused_activation_t actType,
                      cy_nn_act_intrpl_param_t *intrplParam);

/**
 *****************************************************************************
 ** \brief 2D Convolution DMA mode kernel API, API will configure DMA descriptor
 ** pointing nnlite MEMIO configuration structure. Valid scratch buffer should be
 ** passed in convParam, scratch buffer will be used for nnlite MEMIO
 ** configuration structure, size of scratch buffer should be value return from
 ** Cy_NNLite_ScratchBufSize. CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 **
 ** filterData points to weights if sparse weight or non sparse based base on
 ** type of packing is used
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter pointer
 **
 ** \param [in]  biasData         bias pointer
 **
 ** \param [in]  convParam        convolution parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for PWL @c actType output activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_ConvolutionDMA(const int8_t* inputData, int8_t* outData,
                         const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                         const cy_nn_dims_t *filterDims, const int8_t *filterData,
                         const int32_t *biasData,
                         cy_nn_conv_params_t *convParam,
                         cy_en_nnlite_fused_activation_t actType,
                         cy_nn_act_intrpl_param_t *intrplParam);

/**
 *****************************************************************************
 ** \brief Depthwise Convolution CPU mode kernel API, API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function.
 ** depth multiplier considers as additional stacked channels rather than separate
 ** filter channel = input_channel * depth.
 **  \note sparse weight data is not supported in depth-wise convolution operation
 ** instead of normal “NHWC” special layout is used for depth-wise
 ** the layout depends on the number of weights being processed in parallel 'P'
 ** (depthMultiplier) P maximum is 4.
 **  -  Bias buffer should be always 128 bit aligned, i.e. for 8-bit activations bias buffer
 ** should be allocated in multiple of 4 32 bit words and for 16-bit activations bias buffer
 ** should be allocated in mutiple of 2 64 bit words.
 **  - layout format will be **[N/P]×H×W×P  weights for the complete P-weight “stripes” weights, followed by
 ** 1×H×W×|N|p   array of weights for a final partial stripe < P weights (empty if |N|p≠0 )
 ** P maximum is 4 (2 for 16-bit activations), activation unit first fetches all
 ** activations for the sums-of-products for the first 4 (2 for 16 bit)filters
 ** then the activations, for the next 4 (2) and so on. Below mention picture show layout for
 ** 16 bit activations
 ** \image html depthwise_kernel_memory_layout.png
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter pointer
 **
 ** \param [in]  biasData         bias pointer
 **
 ** \param [in]  convParam        convolution parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for PWL @c actType activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_DepthwiseConvolution(const int8_t* inputData, int8_t* outData,
                               const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                               const cy_nn_dims_t *filterDims, const int8_t *filterData,
                               const int32_t *biasData,
                               cy_nn_conv_params_t *convParam,
                               cy_en_nnlite_fused_activation_t actType,
                               cy_nn_act_intrpl_param_t *intrplParam);

/**
 *****************************************************************************
 ** \brief Depthwise DMA  mode kernel API, API will configure DMA descriptor
** pointing nnlite MEMIO configuration structure. Valid scratch buffer should be
 ** passed in convParam, scratch buffer will be used for nnlite MEMIO
 ** configuration structure, size of scratch buffer should be value return from
 ** Cy_NNLite_ScratchBufSize. CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 ** depth multiplier considers as additional stacked channels rather than separate
 ** filter channel = input_channel * depth
 **\note sparse weight data is not supported in depth-wise convolution operation
 ** instead of normal “NHWC” special layout is used for depth-wise
 **  -  Bias buffer should be always 128 bit aligned, i.e. for 8-bit activations bias buffer should be
 ** allocated in multiple of 4 32 bit words and for 16-bit activations bias buffer should be allocated
 ** in  mutiple of for 2 64 bit words.
 ** the layout depends on the number of weights being processed in parallel 'P'
 ** (depthMultiplier) layout format will be
 ** [N/P]×H×W×P  weights for the complete P-weight “stripes” weights, followed by
 ** 1×H×W×|N|p   array of weights for a final partial stripe < P weights (empty if |N|p≠0 )
 ** P 2-dimensional channel-specific filters in parallel, each called stripe is
 ** Pmax 4 for 8 bit activations (2 for 16-bit activations).
 ** For each 2D (HW) sampling position the activation unit first fetches all activations for
 ** the sums-of-products for the first 4 (2) filters (i.e. the first stripe), then the activations,
 ** for the next 4 (2) and so on. Below mentioned picture show layout with 16 bit activations
 **
 ** \image html depthwise_kernel_memory_layout.png
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter pointer
 **
 ** \param [in]  biasData         bias pointer
 **
 ** \param [in]  convParam        convolution parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for PWL @c actType activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_DepthwiseConvolutionDMA(const int8_t* inputData, int8_t* outData,
                                  const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                                  const cy_nn_dims_t *filterDims, const int8_t *filterData,
                                  const int32_t *biasData,
                                  cy_nn_conv_params_t *convParam,
                                  cy_en_nnlite_fused_activation_t actType,
                                  cy_nn_act_intrpl_param_t *intrplParam);

/**
 *****************************************************************************
 ** \brief Fully connected CPU mode kernel API, API will configure nnlite and
 ** then start nnlite operation.API will work in blocking mode
 ** For case inputDims->dims[0] > 1,scratch buffer is required
 ** scratch buffer size in CPU should be calculated using Cy_NNLite_FC_ScratchBufSize API
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter data (weights or packed weights structure) pointer
 **
 ** \param [in]  biasData         bias pointer  N.b. 64-bit per value fo r16-bit activations
 **
 ** \param [in]  fcParam          fully Connected parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for PWL @c actType activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_FullyConnected(const int8_t* inputData, int8_t* outData,
                         const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                         const cy_nn_dims_t *filterDims, const int8_t *filterData,
                         const int32_t *biasData,
                         cy_nn_fc_params_t *fcParam,
                         cy_en_nnlite_fused_activation_t actType,
                         cy_nn_act_intrpl_param_t *intrplParam);

/**
 *****************************************************************************
 ** \brief Fully connected DMA mode kernel API, API will configure DMA descriptor
 ** pointing nnlite MEMIO configuration structure. Valid scratch buffer should be
 ** passed in fcParam, scratch buffer will be used for nnlite MEMIO
 ** configuration structure, size of scratch buffer should be value return from
 ** Cy_NNLite_ScratchBufSize + Cy_NNLite_FC_ScratchBufSize.
 ** Cy_NNLite_FC_ScratchBufSize is required for case inputDims->dims[0] > 1
 ** CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
  **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  filterData       filter data (weights or packed weights structure) pointer
 **
 ** \param [in]  biasData         bias pointer  N.b. 64-bit per value fo r16-bit activations
 **
 ** \param [in]  fcParam          fully Connected parameter structure pointer
 **
 ** \param [in]  actType          output activation type
 **
 ** \param [in]  intrplParam      interpolation param for PWL @c actType activation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_FullyConnectedDMA(const int8_t* inputData, int8_t* outData,
                            const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                            const cy_nn_dims_t *filterDims, const int8_t *filterData,
                            const int32_t *biasData,
                            cy_nn_fc_params_t *fcParam,
                            cy_en_nnlite_fused_activation_t actType,
                            cy_nn_act_intrpl_param_t *intrplParam);
/**
 *****************************************************************************
 ** \brief Average pool CPU mode kernel API, API will configure nnlite.
 ** and then start nnlite operation. API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  avgpoolParam     average pool parameter structure pointer
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Avgpool(const int8_t* inputData, int8_t* outData,
                  const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                  const cy_nn_dims_t *filterDims,
                  cy_nn_pool_params_t *avgpoolParam);

/**
 *****************************************************************************
 ** \brief Average pool CPU mode kernel API, API will configure DMA descriptor
 ** pointing nnlite MEMIO configuration structure. Valid scratch buffer should be
 ** passed in avgpoolParam, scratch buffer will be used for nnlite MEMIO
 ** configuration structure, size of scratch buffer should be value return from
 ** Cy_NNLite_ScratchBufSize. CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  avgpoolParam     average pool parameter structure pointer
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_AvgpoolDMA(const int8_t* inputData, int8_t* outData,
                     const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                     const cy_nn_dims_t *filterDims,
                     cy_nn_pool_params_t *avgpoolParam);


/**
 *****************************************************************************
 ** \brief Max pool CPU mode kernel API, API will configure nnlite.
 ** and then start nnlite operation. API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  poolParam     average pool parameter structure pointer
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Maxpool(const int8_t* inputData, int8_t* outData,
                  const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                  const cy_nn_dims_t *filterDims,
                  cy_nn_pool_params_t *poolParam);
/**
 *****************************************************************************
 ** \brief Max pool CPU mode kernel API, API will configure DMA descriptor
 ** pointing nnlite MEMIO configuration structure. Valid scratch buffer should be
 ** passed in poolParam, scratch buffer will be used for nnlite MEMIO
 ** configuration structure, size of scratch buffer should be value return from
 ** Cy_NNLite_ScratchBufSize. CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 **
 ** \param [in]  inputData        activation buffer pointer
 **
 ** \param [in]  outData         output buffer pointer
 **
 ** \param [in]  inputDims        activation dimension pointer
 **
 ** \param [in]  outputDims     output dimension pointer
 **
 ** \param [in]  filterDims       filter dimension pointer
 **
 ** \param [in]  poolParam     average pool parameter structure pointer
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_MaxpoolDMA(const int8_t* inputData, int8_t* outData,
                     const cy_nn_dims_t *inputDims, const cy_nn_dims_t *outputDims,
                     const cy_nn_dims_t *filterDims,
                     cy_nn_pool_params_t *poolParam);

/**
 *****************************************************************************
 * @brief Precomputation of NPU scaling factor settings for NPU binary operations
 *
 * @param ss          Scaling factors NPU Operation
 * @param lhs_scale   Scale factor for "left hand side" input values
 * @param rhs_scale   Scale factor for "right hand side" input values
 * @param output_scale  Scale factor for final output values.
 * @param input_size  Bitwidth of (MAC) input values.
 * @param op_type     ALU Operation
 * @param act_type    Fused action function to be applied
 * @return cy_en_nnlite_status_t  Success status (checks for unsupported ops/activations)
 */

cy_en_nnlite_status_t
Cy_NNLite_Scaling_Setup(cy_nn_scaling_t *ss,
                        float lhs_scale, float rhs_scale, float output_scale,
                        cy_en_nnlite_activation_size_t input_size,
                        cy_en_nnlite_op_t op_type,
                        cy_en_nnlite_fused_activation_t act_type);

/**
 *****************************************************************************
 ** @brief Set scaling configuration to "no scaling" (fast)
 **
 ** @param ss Point to Scaling configuration to be
 */

void
Cy_NNLite_Scaling_Q_Setup(cy_nn_scaling_t *ss);

/**
 *****************************************************************************
 ** \brief Generic binary op CPU mode kernel API, API will configure nnlite.
 ** and then start nnlite operation. API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 **
 ** Limited broadcasting is supported.  For
 ** rhsOuputDims [D_1,..,D_m,..,D_n] and lhsDims = [1,...,Dm,..Dn]
 ** lhsData is repeated for the [D_1,...,D_(m-1)] major coordinate positions in rhsData.
 **
 ** Internally implemented as "depthwise" summation using 1x1 kernel.
 **
 **
 ** \param [in]  lhsData        lhs input tensor buffer pointer
 **
 ** \param [in]  rhsData        rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  lhsDims        dimensions of lhs argument (repeated if less elts than inputDims )
 **
 ** \param [in]  rhsOutDims     dimensions of rhs argument  and output.
 **
 ** \param [in]  pwParams      Pointwise op params (lhs and output rescaling factors)
 **
 ** \param [in] op_type        MAC-unit operating mode to configure
 **
 ** \param [in] act_type       Activation function to configure
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 **
 *****************************************************************************/

