PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/nnkernel_v1/COMPONENT_PSE84_A0/include/cy_nn_kernel.h
cy_en_nnlite_status_t
Cy_NNLite_AddSubMul(const int8_t* lhsData, const int8_t *rhsData, int8_t* outData,
                    const cy_nn_dims_t *lhsDims, const cy_nn_dims_t *rhsOutDims,
                    const cy_nn_pwise_binary_params_t *pwParams, cy_en_nnlite_op_t op_type,
                    cy_en_nnlite_fused_activation_t act_type
                   );

/**
 *****************************************************************************
 ** \brief Generic binary op CPU mode kernel API, API will configure DMA descriptor
 ** pointing nnlite MEMIO configuration structure. Valid scratch buffer should be
 ** passed in pwParams, scratch buffer will be used for nnlite MEMIO
 ** configuration structure, size of scratch buffer should be value return from
 ** Cy_NNLite_ScratchBufSize. CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 **
 ** Limited broadcasting is supported.  For
 ** rhsOuputDims [D_1,..,D_m,..,D_n] and lhsDims = [1,...,Dm,..Dn]
 ** lhsData is repeated for the [D_1,...,D_(m-1)] major coordinate positions in rhsData.
 **
 ** Internally implemented as "depthwise" summation using 1x1 kernel.
 **
 **
 ** \param [in]  lhsData        lhs input tensor buffer pointer
 **
 ** \param [in]  rhsData        rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  lhsDims        dimensions of lhs argument (repeated if less elts than inputDims )
 **
 ** \param [in]  rhsOutDims     dimensions of rhs argument  and output.
 **
 ** \param [in]  pwParams      Pointwise op params (lhs and output rescaling factors)
 **
 ** \param [in] op_type        MAC-unit operating mode to configure
 **
 ** \param [in] act_type       Activation function to configure
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 **
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_AddSubMulDMA(const int8_t* lhsData, const int8_t *rhsData, int8_t* outData,
                       const cy_nn_dims_t *lhsDims, const cy_nn_dims_t *rhsOutDims,
                       const cy_nn_pwise_binary_params_t *pwParams, cy_en_nnlite_op_t op_type,
                       cy_en_nnlite_fused_activation_t act_type
                      );


/**
 *****************************************************************************
 ** \brief Pointwise addition operation
 **
 ** Pointwise addition CPU mode kernel API, API will configure nnlite.
 ** and then start nnlite operation. API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 **
 ** Limited broadcasting is supported.  For
 ** rhsOuputDims [D_1,..,D_m,..,D_n] and lhsDims = [1,...,Dm,..Dn]
 ** lhsData is repeated for the [D_1,...,D_(m-1)] major coordinate positions in rhsData.
 ** Internally implemented as "depthwise" summation using 1x1 kernel.
 **
 ** \param [in]  lhsData        lhs input tensor buffer pointer
 **
 ** \param [in]  rhsData        rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  lhsDims        dimensions of lhs argument (repeated if less elts than inputDims )
 **
 ** \param [in]  rhsOutDims        rhs argument  and output.
 **
 ** \param [in]  pwParams      Pointwise op params (lhs and output rescaling factors)
 **
 ** \retval Refer \ref cy_en_nnlite_status_t

 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_Add(const int8_t* lhsData, const int8_t *rhsData, int8_t* outData,
              const cy_nn_dims_t *lhsDims, const cy_nn_dims_t *rhsOutDims,
              const cy_nn_pwise_binary_params_t *pwParams);

/**
 *****************************************************************************
 ** \brief Pointwise addition operation
 **
 ** Pointwise addition DMA mode kernel API, API will configure DMA descriptor
 ** pointing nnlite MEMIO configuration structure. Valid scratch buffer should be
 ** passed in pwParams, scratch buffer will be used for nnlite MEMIO
 ** configuration structure, size of scratch buffer should be value return from
 ** Cy_NNLite_ScratchBufSize. CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 **
 ** Limited broadcasting is supported.  For
 ** rhsOuputDims [D_1,..,D_m,..,D_n] and lhsDims = [1,...,Dm,..Dn]
 ** lhsData is repeated for the [D_1,...,D_(m-1)] major coordinate positions in rhsData.
 ** Internally implemented as "depthwise" summation using 1x1 kernel.
 **
 ** \param [in]  lhsData        lhs input tensor buffer pointer
 **
 ** \param [in]  rhsData        rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  lhsDims        dimensions of lhs argument (repeated if less elts than inputDims )
 **
 ** \param [in]  rhsOutDims        rhs argument  and output.
 **
 ** \param [in]  pwParams      Pointwise op params (lhs and output rescaling factors)
 **
 ** \retval Refer \ref cy_en_nnlite_status_t

 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_AddDMA(const int8_t* lhsData, const int8_t *rhsData, int8_t* outData,
                 const cy_nn_dims_t *lhsDims, const cy_nn_dims_t *rhsOutDims,
                 const cy_nn_pwise_binary_params_t *pwParams);

/**
 *****************************************************************************
 ** \brief Pointwise addition operation
 **
 ** Pointwise addition CPU mode kernel API, API will configure nnlite and
 ** then start nnlite operation.API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 **
 ** Limited broadcasting is supported.  For
 ** rhsOuputDims [D_1,..,D_m,..,D_n] and lhsDims = [1,...,Dm,..Dn]
 ** lhsData is repeated for the [D_1,...,D_(m-1)] major coordinate positions in rhsData.
 ** Internally implemented as "depthwise" summation using 1x1 kernel.
 **
 ** \param [in]  lhsData        lhs input tensor buffer pointer
 **
 ** \param [in]  rhsData        rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  lhsDims        dimensions of lhs argument (repeated if less elts than inputDims )
 **
 ** \param [in]  rhsOutDims        rhs argument  and output.
 **
 ** \param [in]  pwParams       Pointwise op params (lhs and output rescaling factors)
**
 ** \param [in]  left_from_right   Compute rhsData - lhsData rather than lhsData - rhsData
 **
 ** \retval Refer \ref cy_en_nnlite_status_t

 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_Sub(const int8_t* lhsData, const int8_t *rhsData, int8_t* outData,
              const cy_nn_dims_t *lhsDims, const cy_nn_dims_t *rhsOutDims,
              const cy_nn_pwise_binary_params_t *pwParams,
              bool left_from_right);

/**
 *****************************************************************************
 ** \brief Pointwise addition operation
 **
 ** Pointwise addition DMA mode kernel API, API will configure DMA descriptor
 ** pointing nnlite MEMIO configuration structure. Valid scratch buffer should be
 ** passed in pwParams, scratch buffer will be used for nnlite MEMIO
 ** configuration structure, size of scratch buffer should be value return from
 ** Cy_NNLite_ScratchBufSize. CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 **
 ** Limited broadcasting is supported.  For
 ** rhsOuputDims [D_1,..,D_m,..,D_n] and lhsDims = [1,...,Dm,..Dn]
 ** lhsData is repeated for the [D_1,...,D_(m-1)] major coordinate positions in rhsData.
 ** Internally implemented as "depthwise" summation using 1x1 kernel.
 **
 ** \param [in]  lhsData        lhs input tensor buffer pointer
 **
 ** \param [in]  rhsData        rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  lhsDims        dimensions of lhs argument (repeated if less elts than inputDims )
 **
 ** \param [in]  rhsOutDims        rhs argument  and output.
 **
 ** \param [in]  pwParams       Pointwise op params (lhs and output rescaling factors)
**
 ** \param [in]  left_from_right   Compute rhsData - lhsData rather than lhsData - rhsData
 **
 ** \retval Refer \ref cy_en_nnlite_status_t

 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_SubDMA(const int8_t* lhsData, const int8_t *rhsData, int8_t* outData,
                 const cy_nn_dims_t *lhsDims, const cy_nn_dims_t *rhsOutDims,
                 const cy_nn_pwise_binary_params_t *pwParams,
                 bool left_from_right);

/**
 *****************************************************************************
 ** \brief multiplication
 **
 ** Pointwise multiplication CPU mode kernel API, API will configure nnlite and
 ** then start nnlite operation. API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 **
 ** Limited broadcasting is supported.  For
 ** rhsOuputDims [D_1,..,D_m,..,D_n] and lhsDims = [1,...,Dm,..Dn]
 ** lhsData is repeated for the [D_1,...,D_(m-1)] major coordinate positions in rhsData.
 ** Internally implemented as "depthwise" summation using 1x1 kernel.
 **
 ** \param [in]  lhsData        lhs input tensor buffer pointer
 **
 ** \param [in]  rhsData        rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  lhsDims        dimensions of lhs argument (repeated if less elts than inputDims )
 **
 ** \param [in]  rhsOutDims        rhs argument  and output.
 **
 ** \param [in]  pwParams      Pointwise op params (lhs and output rescaling factors)
 **
 ** \retval Refer \ref cy_en_nnlite_status_t

 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_Mul(const int8_t* lhsData, const int8_t *rhsData, int8_t* outData,
              const cy_nn_dims_t *lhsDims, const cy_nn_dims_t *rhsOutDims,
              const cy_nn_pwise_binary_params_t *pwParams);

/**
 *****************************************************************************
 ** \brief Pointwise multiplication with simple broadcast
 **
 ** Pointwise multiplication DMA mode kernel API, API will configure DMA descriptor
 ** pointing nnlite MEMIO configuration structure. Valid scratch buffer should be
 ** passed in pwParams, scratch buffer will be used for nnlite MEMIO
 ** configuration structure,size of scratch buffer should be value return from
 ** Cy_NNLite_ScratchBufSize. CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 **
 ** Limited broadcasting is supported.  For
 ** rhsOuputDims [D_1,..,D_m,..,D_n] and lhsDims = [1,...,Dm,..Dn]
 ** lhsData is repeated for the [D_1,...,D_(m-1)] major coordinate positions in rhsData.
 ** Internally implemented as "depthwise" summation using 1x1 kernel.
 **
 ** \param [in]  lhsData        lhs input tensor buffer pointer
 **
 ** \param [in]  rhsData        rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  lhsDims        dimensions of lhs argument (repeated if less elts than inputDims )
 **
 ** \param [in]  rhsOutDims        rhs argument  and output.
 **
 ** \param [in]  pwParams      Pointwise op params (lhs and output rescaling factors)
 **
 ** \retval Refer \ref cy_en_nnlite_status_t

 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_MulDMA(const int8_t* lhsData, const int8_t *rhsData, int8_t* outData,
                 const cy_nn_dims_t *lhsDims, const cy_nn_dims_t *rhsOutDims,
                 const cy_nn_pwise_binary_params_t *pwParams);

/**
 *****************************************************************************
 ** \brief Unfused Activation function CPU mode kernel API, API will configure nnlite and
 ** then start nnlite operation. API will work in blocking mode
 ** if callback function in  Kernel config structure is NULL,
 ** if valid callback function is passed in Kernel config, API will be non-blocking
 ** and callback function will be called after completion of layer, caller need to
 ** wait for callback function before calling another Kernel API, else error will be
 ** for other function
 **
 ** Internally implemented as "depthwise" operation on 1x1xC input
 **
 **
 ** \param [in]  inData         rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  inoutDims      rhs argument  and output.
 **
 ** \param [in]  actParams      unfused activation op params (lhs and output rescaling factors)
 **
 ** \param [in] act_type        Activation function to apply.
 **
 ** \param [in]  intrplParam    interpolation param for PWL output activation , null = nothing set
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Activation(const int8_t *inData, int8_t* outData,
                     const cy_nn_dims_t *inoutDims,
                     const cy_nn_pwise_unary_params_t *actParams,
                     cy_en_nnlite_fused_activation_t act_type,
                     cy_nn_act_intrpl_param_t *intrplParam);


/**
 *****************************************************************************
 ** \brief Unfused Activation function DMA mode kernel API,API will configure
 ** DMA descriptor pointing nnlite MEMIO configuration structure. Valid
 ** scratch buffer should be passed in actParams, scratch buffer will be used
 ** for nnlite MEMIO configuration structure,size of scratch buffer should be
 ** value return from Cy_NNLite_ScratchBufSize.
 ** CY_NNLITE_OP_QUEUED will be the return value on success
 ** After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 **
 ** Internally implemented as "depthwise" operation on 1x1xC input
 **
 **
 ** \param [in]  inData         rhs input tensor pointer (elts repeated if less elts than lhs)
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  inoutDims      rhs argument  and output.
 **
 ** \param [in]  actParams      unfused activation op params (lhs and output rescaling factors)
 **
 ** \param [in] act_type        Activation function to apply.
 **
 ** \param [in]  intrplParam    interpolation param for PWL output activation , null = nothing set
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 **
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_ActivationDMA(const int8_t *inData, int8_t* outData,
                        const cy_nn_dims_t *inoutDims,
                        const cy_nn_pwise_unary_params_t *actParams,
                        cy_en_nnlite_fused_activation_t act_type,
                        cy_nn_act_intrpl_param_t *intrplParam);


/**
 * @brief Compute composite LayerNorm operation
 *
 * @note This is a "macro" kernel requiring multiple primitive NNLite operations to compute.
 *
 * @param inputData      Input tensor data
 * @param outputData     Output tensor data (MUST be distinct from @c inData)
 * @param inputDims   Input dimension pointer
 * @param outputDims  Output dimension pointer
 * @param lnParams    LayerNorm parameter structure pointer.
 * @return cy_en_nnlite_status_t
 */

cy_en_nnlite_status_t
Cy_NNLite_LayerNorm(const int8_t *inputData, int8_t* outputData,
                    const cy_nn_dims_t *inputDims,
                    const cy_nn_dims_t *outputDims,
                    const cy_nn_layernorm_params_t *lnParams);


/**
 *****************************************************************************
 ** API will return scratch buffer size for LayerNorm kernel,
 ** buffer will be used for intermediate calculations
 **
 *****************************************************************************/
uint32_t Cy_NNLite_LayerNormScratchBufSize(const cy_nn_dims_t *inputDims,
        cy_en_nnlite_activation_size_t inputSize);

/**
 *****************************************************************************
 ** \brief Byte block copy using NNLite
 **
 ** Internally implemented as "depthwise" operation on 1x1xC input
 **
 **
 ** \param [in]  inData         address start byte vector  to be copied
 **
 ** \param [in]  outData        destination start address
 **
 ** \param [in]  count          Number of bytes to be copied
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 **
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_Byte_Copy(const int8_t *inData, int8_t* outData,
                    uint32_t count);

/**
 *****************************************************************************
 ** \brief Float reciprocal of (sums of) unsigned Q.31 values CPU mode kernel API
 **
 **
 ** Internally implemented as summing  WxC input over the minor axis to produce
 ** W outputs
 **
 **
 ** API will configure nnlite and
 ** then start nnlite operation. Callback function from kernel config structure
 ** will be called after completion of layer. Kernel config structure should
 ** point to valid callback function.
 **
 ** \param [in]  inData        rhs input tensor pointer
 **
 ** \param [in]  outData        output buffer pointer
 **
 ** \param [in]  inoutDims         input values
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 **
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_Q31Reciprocal(const uint32_t *inData, float* outData,
                        const cy_nn_dims_t *inoutDims);


/**
 ** @brief LSTM unidirectional function with 8 bit input and output and 16 bit gate output
 ** Peephole connections, projection, clipping, combined input/forget gate and layer normalization are not supported.
 **
 ** @param[in]   scratch_buffers                 Struct containing scratch buffers
 **                                              Expected size for each scratch buffer is
 **                                              lstm_dims->num_batches * lstm_dims->num_outputs.
 ** @param[in]   input_data                      Pointer to input data
 ** @param[in]   lstm_dims                       LSTM input parameters related to dimensions
 ** @param[in]   input_to_input_weights          Input to input weights
 ** @param[in]   input_to_forget_weights         Input to forget weights
 ** @param[in]   input_to_cell_weights           Input to cell weights
 ** @param[in]   input_to_output_weights         Input to output weights
 ** @param[in]   recurrent_to_input_weights      Recurrent to input weights
 ** @param[in]   recurrent_to_forget_weights     Recurrent to forget weights
 ** @param[in]   recurrent_to_cell_weights       Recurrent to cell weights
 ** @param[in]   recurrent_to_output_weights     Recurrent to output weights
 ** @param[in]   projection_weights              Projection weights. Not used.
 ** @param[in]   lstm                            LSTM parameters. See struct declaration
 ** @param[in]   output_state                    Pointer to (recurrent) output state
 ** @param[in]   cell_state                      Pointer to cell state
 ** @param[in]   output_data                     Pointer to output state
 **
 ** @note Derived from and API consistent with CMSIS-NN cy_nn_lstm_unidirectional_s16_s8 implementation for convenience.
 **       Following assumptions are done based on LSTM functionality as supported by
 **       Keras version 2.9.0 at the time of development. As stated here,
 **       https://github.com/tensorflow/community/blob/master/rfcs/20180920-unify-rnn-interface.md
 **       Keras's LSTMCell is equivalent to TensorFlow's BasicLSTMCell,
 **       which does not support peephole, clipping or projection.
 **       Layer normalization and combined input/forget gate are not supported either.
 **
 **       1 Input to input weight can not be nullptr. Otherwise nullptr for combined input/forgat gate.
 **       2 Cell weights are not used and should be nullptr. Otherwise needed for peephole connections.
 **       3 Projection weight is not used and should be nullptr. Otherwise needed for projection.
 **
 ** @return    cy_en_nnlite_status_t Exit status (CY_NNLITE_SUCCESS for successful execution)
 **
 **
 */
cy_en_nnlite_status_t Cy_NNLite_LSTM_Int8(cy_nn_lstm_context *scratch_buffers,
        const int8_t *input_data,
        const cy_nn_lstm_dims *lstm_dims,
        const int8_t *input_to_input_weights,
        const int8_t *input_to_forget_weights,
        const int8_t *input_to_cell_weights,
        const int8_t *input_to_output_weights,
        const int8_t *recurrent_to_input_weights,
        const int8_t *recurrent_to_forget_weights,
        const int8_t *recurrent_to_cell_weights,
        const int8_t *recurrent_to_output_weights,
        const int8_t *projection_weights,
        const cy_nn_lstm_params *lstm,
        int8_t *output_state,
        int16_t *cell_state,
        int8_t *output_data);


/**
 ** @brief Compute scratch buffer size needed to compute row-wise softmax of 2D input tensor
 **
 ** @param[in] inoutDims   Input tensors dimensions (rows, cols)
 ** @param[in] act_size    Data element size of input
 ** @return uint32_t  Size of scratch buffer required in bytes
 */
uint32_t
Cy_NNLite_SoftMax_ScratchBufSize(const cy_nn_dims_t *inoutDims,
                                 const cy_en_nnlite_activation_size_t act_size);

/**
 * @brief Compute size scratch buffer required for FC op.
 * @param inDims input dimensions of FC operation
 * @param outDims Output dimensions of FC operation
 * @return uint32_t Size of scratch buffer required
 */
uint32_t Cy_NNLite_FC_ScratchBufSize(const cy_nn_dims_t *inDims, const cy_nn_dims_t *outDims);
/**
 ** @brief Compute scratch buffer size needed for DMA mode API
 ** @return uint32_t  Size of scratch buffer required in bytes
 */
uint32_t Cy_NNLite_DMAModeScratchBufSize(void);
/**
 *****************************************************************************
 ** \brief Cy_NNLite_TriggerDMAQueue will trigger DMA transfer of Queued layer
 ** starting from first queued layer, callback function will be called after
 ** completion of all the Queued layer if valid callback function is passed
 ** in kernel context, API will work in blocking mode if callback function is
 ** NULL
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_TriggerDMAQueue(void);

