PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/nnkernel_v1/COMPONENT_PSE84_A0/include/cy_nn_kernel.h
/**
 *****************************************************************************
 ** \brief Cy_NNLite_GetQueuedLayerCount will return count of queued layer
 ** for DMA
 **
 ** \retval dmaQDepth number of layers in DMA Queue
 *****************************************************************************/
uint32_t Cy_NNLite_GetQueuedLayerCount(void);


/**
 *****************************************************************************
 ** \brief Cy_NNLite_GetCurrDMAQueue API will copy current dma queue in to
 ** dmaQueue pointer, valid dmaQueue pointer should be passed.
 ** To get the runnable queue Cy_NNLite_GetCurrDMAQueue should be
 ** called after the created in Kernel DMA API such as Cy_NNLite_AvgpoolDMA
 ** and get executed by calling Cy_NNLite_TriggerDMAQueue
 **
 ** \param [in] dmaQueue dma queue pointer in which dma queue will be copied
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_GetCurrDMAQueue(cy_nnlite_dma_queue_config_t *dmaQueue);

/**
 *****************************************************************************
 ** \brief Cy_NNLite_RunDMAQueue API will Trigger DMA dmaQueue queue
 ** valid dmaQueue pointer should be passed, DMA queue should return
 ** from Cy_NNLite_GetCurrDMAQueue
 ** queue will be in  runnable state if Cy_NNLite_GetCurrDMAQueue
 ** called after queue created in Kernel DMA API such as Cy_NNLite_AvgpoolDMA
 ** and get executed by calling Cy_NNLite_TriggerDMAQueue.
 ** API will work in blocking mode if callback function is passed as NULL
 ** in kernel context
 **
 ** \param [in] dmaQueue dma queue pointer in which dma queue will be copied
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_RunDMAQueue(cy_nnlite_dma_queue_config_t *dmaQueue);
/**
 *****************************************************************************
 **
 ** @brief Compute row-wise softmax of 2D input tensor
 **
 ** @param inData
 ** @param outData
 ** @param expTempBuf
 ** @param inoutDims
 ** @param smParams
 ** @return cy_en_nnlite_status_t
 *****************************************************************************
 */
cy_en_nnlite_status_t
Cy_NNLite_SoftMax(const int8_t *inData, int8_t* outData,
                  int8_t *expTempBuf,
                  const cy_nn_dims_t *inoutDims,
                  const cy_nn_pwise_unary_params_t *smParams);


/**
 *****************************************************************************
 **
 ** @brief Compute Q1.15 complex FFT
 **
 ** NNLite implements Decimation-in-Time  Radix-2 FFT
 ** for 16 bit input buffers should be allocated for 32 bit, buffers
 ** will be used in ping-pong mode final output will be in buf0 for even stage
 ** for odd stage buf1 will have final output
 ** @note FFT length =^= Number complex input values *2 = #
 ** @param ppBuf0    Input / ping-pong buffer 0, Output (even stages/# values)
 ** @param ppBuf1    ping-pong buffer 1, Output (odd stages/# values)
 ** @param fftStages   log_2(FFT length)
 **
 ** @return cy_en_nnlite_status_t
 *****************************************************************************
 */
cy_en_nnlite_status_t
Cy_NNLite_FFT(int32_t *ppBuf0, int32_t* ppBuf1,
              unsigned int fftStages);

/**
 *****************************************************************************
 **
 ** @brief Compute Q1.15 complex FFT DMA mode API
 ** API will configure DMA descriptor pointing nnlite MEMIO configuration structure.
 ** Valid scratchBuf should be passed in pParam, scratch buffer will be used for
 ** nnlite MEMIO  configuration structure, size of scratch buffer should be value
 ** return from Cy_NNLite_ScratchBufSize. CY_NNLITE_OP_QUEUED will be the return
 ** value on success After queuing kernel, DMA needs to be triggered by calling
 ** API Cy_TriggerNNLiteDMAQueue
 **
 ** NNLite implements Decimation-in-Time  Radix-2 FFT
 **
 ** @note FFT length =^= Number complex input values *2 = #
 ** @param ppBuf0    Input / ping-pong buffer 0, Output (even stages/# values)
 ** @param ppBuf1    ping-pong buffer 1, Output (odd stages/# values)
 ** @param fftStages   log_2(FFT length)
 ** @param scratchBuf  Scratch buffer for DMA mode
 **
 ** @return cy_en_nnlite_status_t
 *****************************************************************************
 */
cy_en_nnlite_status_t
Cy_NNLite_FFTDMA(int32_t *ppBuf0, int32_t* ppBuf1,
                 unsigned int fftStages, void *scratchBuf);

/**
 *****************************************************************************
 ** \brief  Kernel Init API, initialize PDL driver and setup IRQ handler,
 ** setup function pointers from kernelConfig argument. This API needs to be
 ** called before calling any other kernel API
 **
 ** \param [in]  kernelConfig  kernel configuration structure
 **
 ** \retval cy_en_nnlite_status_t
 *****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_KernelInit(cy_kernel_config_t *kernelConfig);

/**
*****************************************************************************
** \brief  Kernel Deinit API, de-initialize PDL driver and synchronization
** primitives. needs re initialization after this API is called. Should be
** called only at end of program
**
** \retval cy_en_nnlite_status_t
*****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_KernelDeInit(void);

#if defined(IFX_USE_MXNNLITE_STREAM_EMU)
/**
 *****************************************************************************
 ** \brief  NNLite ISR, Error or completion interrupt
 ** calls completion handlers to notify op completion to API callee
 ** or internal (for ops requiring multiple internal operations).
 **
 *****************************************************************************/
void Cy_NNLite_Isr(void);
#endif

#endif
/** \} group_nn_kernel_functions */

#ifdef __cplusplus
}
#endif
#endif
